Revit 2027 API
ParameterTypeId.AnalyticalElementStructuralRole Property
 "Structural Role": Used for Analytical Elements
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId AnalyticalElementStructuralRole { get; }
Public Shared ReadOnly Property AnalyticalElementStructuralRole As ForgeTypeId
	Get
public:
static property ForgeTypeId^ AnalyticalElementStructuralRole {
	ForgeTypeId^ get ();
}
static member AnalyticalElementStructuralRole : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace